require 'r-fxxk'
class PPAP < Brainfuck
  nxt 'ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ'
  prv 'ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ'
  inc 'ﾍﾟﾝ ﾍﾟﾝ'
  dec 'ｱｯﾎﾟｰ ｱｯﾎﾟｰ'
  put 'ｱｯﾎﾟｰ ﾍﾟﾝ'
  get 'ﾍﾟﾝ ｱｯﾎﾟｰ'
  opn 'ｱｯﾎﾟｰ ﾊﾟｲﾅｯﾎﾟｰ'
  cls 'ﾊﾟｲﾅｯﾎﾟｰ ｱｯﾎﾟｰ'
end

ペンパイナッポーアッポーペン =
"ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ｱｯﾎﾟｰ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ "+
"ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ "+
"ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ｱｯﾎﾟｰ "+
"ﾊﾟｲﾅｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ "+
"ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ "+
"ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ "+
"ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ｱｯﾎﾟｰ "+
"ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ "+
"ｱｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ "+
"ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ "+
"ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ "+
"ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ "+
"ｱｯﾎﾟｰ ｱｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ "+
"ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ｱｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾊﾟｲﾅｯﾎﾟｰ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ﾍﾟﾝ ｱｯﾎﾟｰ ﾍﾟﾝ "
puts PPAP.new.fuck(ペンパイナッポーアッポーペン)
